src/test/resources/artifacts/ESB/config/soapRequests/salesforce/apiGetUserInfoMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:partner.soap.sforce.com">
    <soapenv:Header>
        <urn:SessionHeader>
            <urn:sessionId>%s(session)</urn:sessionId>
        </urn:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <urn:getUserInfo/>
    </soapenv:Body>
</soapenv:Envelope>